{
  "cognitiveCoachQuestionPool": [
    {
      "questionID": "CC001",
      "category": "Treatment Complication",
      "setup": "You're treating a patient with severe respiratory distress. Protocol says high-flow oxygen immediately. But what if the patient has a history of COPD and your partner warns that too much oxygen could suppress their respiratory drive? Walk me through how you'd think about that decision.",
      "expectedGoodReasoning": [
        "Recognizes tension between immediate need (hypoxia) and potential risk (CO2 retention)",
        "Understands that in acute emergency, oxygenation takes priority",
        "Acknowledges this requires monitoring and possible adjustment",
        "Shows comfort with clinical judgment over rigid protocol"
      ],
      "commonFlawedReasoning": [
        "Withholds all oxygen due to COPD (dangerous)",
        "Gives high-flow without any consideration of COPD (not thinking)",
        "Becomes paralyzed by uncertainty (decision avoidance)"
      ],
      "coachFollowUp": "Good - you're weighing immediate threat against potential complication. In emergencies, we treat what's killing them now. Let's try another..."
    },
    {
      "questionID": "CC002",
      "category": "Treatment Complication",
      "setup": "Protocol says give aspirin for chest pain, but the patient mentions they had dark, tarry stools two days ago. They insist the chest pain is severe and want all treatments. How do you think through this decision?",
      "expectedGoodReasoning": [
        "Recognizes melena suggests possible GI bleeding",
        "Aspirin increases bleeding risk significantly",
        "Must weigh cardiac benefit vs bleeding complications",
        "Considers giving with close monitoring or withholding",
        "Acknowledges this is genuinely difficult with no perfect answer"
      ],
      "commonFlawedReasoning": [
        "Protocol says aspirin so give it regardless (ignoring contraindication)",
        "Absolute thinking - never give aspirin with any GI symptoms",
        "Lets patient demand override clinical judgment completely"
      ],
      "coachFollowUp": "Exactly - you're identifying the real tension between cardiac benefit and bleeding risk. Even experienced medics debate this one. Next..."
    },
    {
      "questionID": "CC003",
      "category": "Treatment Complication",
      "setup": "You're about to start an IV on a critically unstable patient, but you've already missed two attempts and veins are blown. Your partner suggests trying an intraosseous line, but you've only done IO on training manikins. What's going through your mind?",
      "expectedGoodReasoning": [
        "Recognizes patient needs vascular access urgently",
        "Acknowledges skill limitation honestly",
        "Considers requesting ALS backup if available",
        "Weighs time to backup vs attempting IO now",
        "Understands sometimes pushing beyond comfort zone is necessary"
      ],
      "commonFlawedReasoning": [
        "Keeps attempting peripheral IV repeatedly (diminishing returns)",
        "Refuses to attempt IO due to lack of confidence (paralysis)",
        "Attempts IO without proper preparation or consideration"
      ],
      "coachFollowUp": "Good thinking - recognizing your limits while knowing when the patient's need outweighs your comfort. That's clinical maturity. Let's continue..."
    },
    {
      "questionID": "CC004",
      "category": "Treatment Complication",
      "setup": "You've given nitroglycerin for chest pain and the patient's blood pressure suddenly drops to 80/50. They're now dizzy and pale. What's your immediate thought process?",
      "expectedGoodReasoning": [
        "Recognizes nitro caused the hypotension",
        "Considers right ventricular infarct possibility",
        "Thinks about fluid bolus for hypotension",
        "Knows not to give more nitro",
        "Reassesses entire patient status systematically"
      ],
      "commonFlawedReasoning": [
        "Panics about the drop without systematic thinking",
        "Gives more nitro thinking patient needs more treatment",
        "Blames patient's underlying condition without considering treatment effect"
      ],
      "coachFollowUp": "Right - treatment complications happen. Your systematic reassessment matters more than perfect execution. Another one..."
    },
    {
      "questionID": "CC005",
      "category": "Patient Communication",
      "setup": "You arrive for chest pain. The patient is pale, sweating, and clutching their chest, but they tell you 'It's just indigestion, I'm not going to the hospital.' You strongly suspect a cardiac event. How do you handle this?",
      "expectedGoodReasoning": [
        "Recognizes denial is common in cardiac patients",
        "Balances patient autonomy with clinical concern",
        "Considers education strategies and family involvement",
        "Understands limits of authority vs persuasion",
        "Acknowledges ethical tension between respecting choice and preventing harm"
      ],
      "commonFlawedReasoning": [
        "Immediately accepts refusal without education (abandonment)",
        "Forces treatment against clear refusal (violation of autonomy)",
        "Becomes adversarial or judgmental toward patient"
      ],
      "coachFollowUp": "Exactly - this is the hardest part. You can educate strongly but ultimately can't force. Let's look at another challenge..."
    },
    {
      "questionID": "CC006",
      "category": "Patient Communication",
      "setup": "You're treating an elderly patient who keeps saying 'I'm fine, don't make a fuss.' But their adult daughter pulls you aside and whispers that her father has been increasingly confused at home and she thinks he's hiding how bad things really are. How do you navigate this?",
      "expectedGoodReasoning": [
        "Recognizes family concern is valuable assessment information",
        "Must still respect patient as primary decision-maker if competent",
        "Considers performing cognitive assessment objectively",
        "Balances family input with patient autonomy",
        "Thinks about elder safety vs respecting independence"
      ],
      "commonFlawedReasoning": [
        "Dismisses patient completely based on family report",
        "Ignores family concern and only listens to patient",
        "Takes sides in family conflict rather than assessing clinically"
      ],
      "coachFollowUp": "Good - you're recognizing the family provides context while respecting the patient's voice. These triangulated situations are tricky. Next..."
    },
    {
      "questionID": "CC007",
      "category": "Patient Communication",
      "setup": "Your patient admits to using cocaine 'a few hours ago' but their symptoms suggest it might be more recent. They're worried about getting in trouble. How do you approach getting accurate information when you suspect they're not being fully honest?",
      "expectedGoodReasoning": [
        "Recognizes accurate drug history is critical for safe treatment",
        "Understands patient fear of judgment or legal consequences",
        "Uses non-judgmental approach to build trust",
        "Explains medical necessity without lecturing",
        "Acknowledges this requires relationship-building under time pressure"
      ],
      "commonFlawedReasoning": [
        "Accepts timeline at face value without questioning",
        "Becomes confrontational about suspected dishonesty",
        "Focuses on moral judgment rather than medical need"
      ],
      "coachFollowUp": "Right - building trust quickly is a clinical skill. Your non-judgmental approach can literally save lives. One more communication scenario..."
    },
    {
      "questionID": "CC008",
      "category": "Patient Communication",
      "setup": "You're treating a teenage patient for an overdose. They're stable now but whisper 'Please don't tell my parents what I took.' You know you need to transport and parents will be notified. How do you handle this moment?",
      "expectedGoodReasoning": [
        "Recognizes teenager's fear and vulnerability",
        "Understands mandatory reporting and parental notification requirements",
        "Balances honesty with compassion",
        "Explains what must happen and why, gently",
        "Focuses on their safety as primary concern"
      ],
      "commonFlawedReasoning": [
        "Makes false promises about confidentiality",
        "Dismisses their concern as unimportant",
        "Immediately tells parents without preparing patient"
      ],
      "coachFollowUp": "Good - you're being honest while staying compassionate. These situations require balancing legal obligations with human connection. Moving on..."
    },
    {
      "questionID": "CC009",
      "category": "Unpredictable Situation",
      "setup": "You administer the correct medication at the correct dose, but the patient's condition doesn't improve - in fact, they seem to be getting worse. What's your thought process in that moment?",
      "expectedGoodReasoning": [
        "Reassesses ABCs - return to fundamentals",
        "Considers alternative diagnoses",
        "Checks for complications from treatment itself",
        "Recognizes when to call for backup/advanced support",
        "Stays calm and systematic despite unexpected outcome"
      ],
      "commonFlawedReasoning": [
        "Panics or freezes",
        "Immediately gives more of same medication (escalation without thinking)",
        "Blames patient or situation rather than reassessing"
      ],
      "coachFollowUp": "Good instinct - when treatment fails, go back to basics. Your systematic approach matters more than having immediate answers. One more..."
    },
    {
      "questionID": "CC010",
      "category": "Unpredictable Situation",
      "setup": "You arrive on scene to find the patient's condition is completely different from what dispatch reported. Instead of a simple fall, you're facing a multi-trauma patient with potential spinal injury. How do you adapt?",
      "expectedGoodReasoning": [
        "Immediately calls for additional resources/ALS",
        "Performs rapid primary survey",
        "Adjusts mental model from dispatch information",
        "Prioritizes life threats over minor complaints",
        "Maintains systematic approach despite surprise"
      ],
      "commonFlawedReasoning": [
        "Continues with dispatch's assessment rather than scene findings",
        "Becomes overwhelmed by unexpected severity",
        "Delays calling for backup while trying to handle alone"
      ],
      "coachFollowUp": "Right - scene findings trump dispatch every time. Your ability to pivot quickly is crucial. Continuing..."
    },
    {
      "questionID": "CC011",
      "category": "Unpredictable Situation",
      "setup": "Mid-transport, your equipment fails - the cardiac monitor stops working and you can't get a manual blood pressure reading. The patient is conscious but seems unstable. What do you do?",
      "expectedGoodReasoning": [
        "Returns to basic assessment skills (pulse, respiratory rate, skin signs)",
        "Uses clinical observation (level of consciousness, work of breathing)",
        "Communicates situation to receiving hospital",
        "Considers pulling over to troubleshoot if critically needed",
        "Doesn't let equipment failure prevent assessment"
      ],
      "commonFlawedReasoning": [
        "Panics about lack of numbers",
        "Delays transport trying to fix equipment",
        "Relies solely on equipment without clinical skills"
      ],
      "coachFollowUp": "Exactly - equipment augments assessment, it doesn't replace it. Your hands and eyes are still your best tools. Next..."
    },
    {
      "questionID": "CC012",
      "category": "Unpredictable Situation",
      "setup": "You're treating a patient when a bystander suddenly collapses nearby. Your current patient is stable but requires monitoring. The bystander appears unconscious. What's your decision-making process?",
      "expectedGoodReasoning": [
        "Quickly assesses severity of both patients",
        "Calls for additional resources immediately",
        "Considers whether current patient can wait briefly",
        "Weighs life threat levels",
        "Makes triage decision systematically"
      ],
      "commonFlawedReasoning": [
        "Abandons first patient without assessment",
        "Ignores second patient due to tunnel vision",
        "Becomes paralyzed trying to help both simultaneously"
      ],
      "coachFollowUp": "Good - you're thinking triage principles under pressure. Sometimes we face impossible choices with only less-bad options. Final unpredictable scenario..."
    },
    {
      "questionID": "CC013",
      "category": "Ethical Dilemma",
      "setup": "You're on scene at a mass casualty incident. You have two critical patients: a young child and an elderly patient. Both need immediate transport but you only have one ambulance. How do you think through this decision?",
      "expectedGoodReasoning": [
        "Uses triage principles (survivability, not age or emotional factors)",
        "Considers which patient has better chance with intervention",
        "Recognizes this is clinical decision, not moral judgment",
        "Calls for additional resources while assessing",
        "Acknowledges the emotional weight but doesn't let it paralyze decision"
      ],
      "commonFlawedReasoning": [
        "Chooses based on age alone (young automatically goes first)",
        "Becomes emotionally paralyzed and delays both",
        "Makes decision based on who's more 'deserving'"
      ],
      "coachFollowUp": "Right - triage is clinical, not emotional or moral. These decisions weigh on us, but we base them on survivability. Next dilemma..."
    },
    {
      "questionID": "CC014",
      "category": "Ethical Dilemma",
      "setup": "A patient with a terminal illness and DNR orders is having severe respiratory distress and begging you to 'do something, help me breathe.' Their DNR specifically says no intubation. What's your thinking here?",
      "expectedGoodReasoning": [
        "Understands DNR doesn't mean 'do not treat'",
        "Recognizes non-invasive support (positioning, oxygen, medications) is appropriate",
        "Distinguishes between comfort care and prohibited interventions",
        "Considers patient's current wishes vs advance directive",
        "Acknowledges complexity of end-of-life care in acute setting"
      ],
      "commonFlawedReasoning": [
        "Interprets DNR as providing no treatment at all",
        "Ignores DNR because patient is currently asking for help",
        "Becomes uncertain about any intervention"
      ],
      "coachFollowUp": "Good distinction - DNR doesn't mean abandoning the patient. You can provide significant comfort without violating their wishes. Continuing..."
    },
    {
      "questionID": "CC015",
      "category": "Ethical Dilemma",
      "setup": "You're treating a patient who is clearly intoxicated and combative. They're refusing assessment and treatment, but you notice what might be a significant head injury. They're telling you to leave. How do you think through your obligations here?",
      "expectedGoodReasoning": [
        "Recognizes intoxication may impair decision-making capacity",
        "Considers head injury could further affect mentation",
        "Thinks about implied consent in emergency situations",
        "Balances patient autonomy with safety concerns",
        "Considers law enforcement involvement for safety"
      ],
      "commonFlawedReasoning": [
        "Leaves immediately because patient refuses",
        "Forces treatment against combative patient without consideration",
        "Dismisses concerns because patient is intoxicated"
      ],
      "coachFollowUp": "Exactly - determining decision-making capacity is clinical, not just accepting or overriding refusal. These grey areas require judgment. Next..."
    },
    {
      "questionID": "CC016",
      "category": "Ethical Dilemma",
      "setup": "You arrive at a home where an elderly patient has clearly been neglected - they're malnourished, lying in soiled bedding, and have pressure ulcers. The family caregiver insists 'we're handling it at home.' What are you thinking about your responsibilities here?",
      "expectedGoodReasoning": [
        "Recognizes signs of potential elder abuse or neglect",
        "Understands mandatory reporting obligations",
        "Balances immediate medical needs with longer-term safety",
        "Considers social services and adult protective services",
        "Thinks about documentation for follow-up"
      ],
      "commonFlawedReasoning": [
        "Only treats immediate medical issues without addressing neglect",
        "Avoids involvement in 'family matters'",
        "Becomes judgmental without considering resources or circumstances"
      ],
      "coachFollowUp": "Good - recognizing your role extends beyond immediate medical care to patient safety. These are mandatory reporting situations. Final scenario..."
    },
    {
      "questionID": "CC017",
      "category": "Time Pressure Decision",
      "setup": "You're mid-assessment on a patient when dispatch calls with a cardiac arrest two blocks away. Your current patient has chest pain but stable vitals. Your ambulance is the closest resource. What's going through your mind?",
      "expectedGoodReasoning": [
        "Weighs relative severity and time-sensitivity",
        "Considers other available resources",
        "Thinks about clinical status of current patient",
        "Recognizes no perfect answer exists",
        "Considers requesting additional resources"
      ],
      "commonFlawedReasoning": [
        "Automatically abandons current patient for cardiac arrest",
        "Refuses to leave current patient regardless of situation",
        "Doesn't consider calling for additional resources"
      ],
      "coachFollowUp": "Right - you're weighing competing critical needs with incomplete information. Sometimes best answer is getting more resources. Next pressure scenario..."
    },
    {
      "questionID": "CC018",
      "category": "Time Pressure Decision",
      "setup": "Your patient is crashing and needs immediate intervention, but a family member is demanding you explain everything you're doing and questioning each medication. You need to work fast. How do you handle this?",
      "expectedGoodReasoning": [
        "Recognizes patient care takes priority",
        "Considers brief acknowledgment of family concern",
        "Thinks about delegating communication to partner",
        "Maintains professional composure under pressure",
        "Plans to explain more thoroughly once patient stabilized"
      ],
      "commonFlawedReasoning": [
        "Stops working to argue with family",
        "Ignores family completely and creates conflict",
        "Becomes flustered and loses focus on patient"
      ],
      "coachFollowUp": "Good - setting boundaries while maintaining professionalism. Patient care comes first, communication when safe. Continuing..."
    },
    {
      "questionID": "CC019",
      "category": "Time Pressure Decision",
      "setup": "You're treating a critical patient and realize you're missing a key piece of equipment your protocol requires. The hospital is 8 minutes away. Do you spend time trying to improvise or just transport immediately?",
      "expectedGoodReasoning": [
        "Weighs benefit of intervention vs time to definitive care",
        "Considers whether improvisation is safe and effective",
        "Thinks about 'scoop and run' vs 'stay and play'",
        "Recognizes hospital can provide what's missing",
        "Makes decision based on patient's trajectory"
      ],
      "commonFlawedReasoning": [
        "Delays transport trying to perfectly follow protocol",
        "Transports without considering any scene interventions",
        "Panics about missing equipment"
      ],
      "coachFollowUp": "Exactly - sometimes the best intervention is rapid transport. Don't let missing equipment override good judgment. Last one..."
    },
    {
      "questionID": "CC020",
      "category": "Time Pressure Decision",
      "setup": "You have three interventions you know this patient needs - IV access, cardiac monitoring, and medication administration. You're working alone because your partner is driving. You can't do all three simultaneously. How do you decide what comes first?",
      "expectedGoodReasoning": [
        "Prioritizes based on immediate threat to life",
        "Considers which interventions enable others (IV before meds)",
        "Thinks about time-sensitivity of each intervention",
        "Recognizes monitoring can wait if ABCs addressed",
        "Stays systematic rather than scattered"
      ],
      "commonFlawedReasoning": [
        "Tries to do everything at once and does nothing well",
        "Chooses easiest task rather than most important",
        "Becomes overwhelmed by multiple needs"
      ],
      "coachFollowUp": "Good - you're prioritizing systematically under pressure. That's exactly the thinking you'll need. Ready for the scenario?"
    }
  ]
}