{
  "cognitiveCoachQuestionPool": [
    {
      "questionID": "CC001",
      "category": "Komplikácia liečby",
      "setup": "Ošetrujete pacienta so závažnou dychovou tiesňou. Protokol hovorí, že treba okamžite podať vysokoprietokový kyslík. Ale čo ak má pacient v anamnéze CHOCHP a váš partner vás varuje, že príliš veľa kyslíka by mohlo potlačiť jeho dychové centrum? Prejdite so mnou, ako by ste o tomto rozhodnutí uvažovali.",
      "expectedGoodReasoning": [
        "Rozpoznáva napätie medzi okamžitou potrebou (hypoxia) a potenciálnym rizikom (retencia CO2)",
        "Chápe, že v akútnej núdzovej situácii má oxygenácia prioritu",
        "Uznáva, že si to vyžaduje monitorovanie a možnú úpravu",
        "Preukazuje istotu v klinickom úsudku nad rigidným protokolom"
      ],
      "commonFlawedReasoning": [
        "Nepodá žiadny kyslík kvôli CHOCHP (nebezpečné)",
        "Podá vysokoprietokový kyslík bez akéhokoľvek zváženia CHOCHP (bez premýšľania)",
        "Je paralyzovaný neistotou (vyhýbanie sa rozhodnutiu)"
      ],
      "coachFollowUp": "Dobre - zvažujete okamžitú hrozbu oproti potenciálnej komplikácii. V núdzových situáciách liečime to, čo ich zabíja teraz. Skúsme ďalšiu..."
    },
    {
      "questionID": "CC002",
      "category": "Komplikácia liečby",
      "setup": "Protokol hovorí, že pri bolesti na hrudníku treba podať aspirín, ale pacient spomenie, že pred dvoma dňami mal tmavú, dechtovitú stolicu. Trvá na tom, že bolesť na hrudníku je silná a chce všetky liečby. Ako premýšľate o tomto rozhodnutí?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že meléna naznačuje možné krvácanie do GIT",
        "Aspirín významne zvyšuje riziko krvácania",
        "Musí zvážiť kardiálny prínos oproti komplikáciám krvácania",
        "Zvažuje podanie s dôkladným monitorovaním alebo nepodanie",
        "Uznáva, že je to skutočne ťažké bez dokonalej odpovede"
      ],
      "commonFlawedReasoning": [
        "Protokol hovorí aspirín, tak ho podá bez ohľadu na všetko (ignorovanie kontraindikácie)",
        "Absolútne myslenie - nikdy nepodať aspirín pri akýchkoľvek príznakoch GIT",
        "Nechá požiadavku pacienta úplne prevalcovať klinický úsudok"
      ],
      "coachFollowUp": "Presne tak - identifikujete skutočné napätie medzi kardiálnym prínosom a rizikom krvácania. Aj skúsení záchranári o tomto diskutujú. Ďalšia..."
    },
    {
      "questionID": "CC003",
      "category": "Komplikácia liečby",
      "setup": "Chystáte sa zaviesť IV prístup kriticky nestabilnému pacientovi, ale už ste dvakrát neuspeli a žily sú prasknuté. Váš partner navrhuje skúsiť intraoseálny prístup, ale vy ste IO robili len na tréningových figurínach. Čo vám prebieha mysľou?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že pacient urgentne potrebuje cievny prístup",
        "Úprimne si priznáva obmedzenie zručností",
        "Zvažuje požiadanie o pomoc RLP, ak je dostupná",
        "Zvažuje čas do príchodu pomoci oproti pokusu o IO teraz",
        "Chápe, že niekedy je potrebné prekročiť svoju komfortnú zónu"
      ],
      "commonFlawedReasoning": [
        "Opakovane sa pokúša o periférny IV prístup (klesajúca úspešnosť)",
        "Odmieta pokus o IO z nedostatku sebavedomia (paralýza)",
        "Pokúša sa o IO bez riadnej prípravy alebo zváženia"
      ],
      "coachFollowUp": "Dobré myslenie - rozpoznávate svoje limity, zatiaľ čo viete, kedy potreba pacienta preváži vaše pohodlie. To je klinická zrelosť. Pokračujme..."
    },
    {
      "questionID": "CC004",
      "category": "Komplikácia liečby",
      "setup": "Podali ste nitroglycerín na bolesť na hrudníku a krvný tlak pacienta náhle klesne na 80/50. Teraz má závraty a je bledý. Aký je váš okamžitý myšlienkový proces?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že nitro spôsobilo hypotenziu",
        "Zvažuje možnosť infarktu pravej komory",
        "Premýšľa o boluse tekutín pri hypotenzii",
        "Vie, že nemá podávať viac nitra",
        "Systematicky prehodnocuje celý stav pacienta"
      ],
      "commonFlawedReasoning": [
        "Panikári kvôli poklesu bez systematického myslenia",
        "Podá viac nitra v domnení, že pacient potrebuje viac liečby",
        "Obviňuje základný stav pacienta bez zváženia účinku liečby"
      ],
      "coachFollowUp": "Správne - komplikácie liečby sa stávajú. Vaše systematické prehodnotenie je dôležitejšie ako dokonalé vykonanie. Ďalšia..."
    },
    {
      "questionID": "CC005",
      "category": "Komunikácia s pacientom",
      "setup": "Prichádzate k bolesti na hrudníku. Pacient je bledý, spotený a drží sa za hrudník, ale hovorí vám: 'Je to len zlé trávenie, nejdem do nemocnice.' Máte silné podozrenie na kardiálnu príhodu. Ako to riešite?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že popieranie je bežné u kardiálnych pacientov",
        "Vyvažuje autonómiu pacienta s klinickým znepokojením",
        "Zvažuje stratégie edukácie a zapojenie rodiny",
        "Chápe limity autority oproti presviedčaniu",
        "Uznáva etické napätie medzi rešpektovaním voľby a predchádzaním poškodeniu"
      ],
      "commonFlawedReasoning": [
        "Okamžite akceptuje odmietnutie bez edukácie (opustenie pacienta)",
        "Núti liečbu proti jasnému odmietnutiu (porušenie autonómie)",
        "Stáva sa nepriateľským alebo odsudzujúcim voči pacientovi"
      ],
      "coachFollowUp": "Presne tak - toto je najťažšia časť. Môžete dôrazne edukovať, ale nakoniec nemôžete nútiť. Pozrime sa na ďalšiu výzvu..."
    },
    {
      "questionID": "CC006",
      "category": "Komunikácia s pacientom",
      "setup": "Ošetrujete staršieho pacienta, ktorý stále hovorí: 'Som v poriadku, nerobte z toho vedu.' Ale jeho dospelá dcéra vás vezme bokom a šepká, že jej otec je doma čoraz viac zmätený a myslí si, že skrýva, aké zlé to v skutočnosti je. Ako sa v tomto zorientujete?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že obavy rodiny sú cennou informáciou pre hodnotenie",
        "Musí stále rešpektovať pacienta ako primárneho rozhodovateľa, ak je spôsobilý",
        "Zvažuje objektívne vykonanie kognitívneho hodnotenia",
        "Vyvažuje príspevok rodiny s autonómiou pacienta",
        "Premýšľa o bezpečnosti staršieho človeka oproti rešpektovaniu nezávislosti"
      ],
      "commonFlawedReasoning": [
        "Úplne odmietne pacienta na základe správy rodiny",
        "Ignoruje obavy rodiny a počúva len pacienta",
        "Stavia sa na jednu stranu v rodinnom konflikte namiesto klinického hodnotenia"
      ],
      "coachFollowUp": "Dobre - rozpoznávate, že rodina poskytuje kontext, zatiaľ čo rešpektujete hlas pacienta. Tieto trojuholníkové situácie sú zložité. Ďalšia..."
    },
    {
      "questionID": "CC007",
      "category": "Komunikácia s pacientom",
      "setup": "Váš pacient priznáva užitie kokaínu 'pred pár hodinami', ale jeho príznaky naznačujú, že to mohlo byť nedávnejšie. Obáva sa, že bude mať problémy. Ako pristupujete k získaniu presných informácií, keď máte podozrenie, že nie je úplne úprimný?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že presná anamnéza užívania drog je kritická pre bezpečnú liečbu",
        "Chápe strach pacienta z odsúdenia alebo právnych následkov",
        "Používa neodsudzujúci prístup na budovanie dôvery",
        "Vysvetľuje medicínsku nevyhnutnosť bez poučovania",
        "Uznáva, že si to vyžaduje budovanie vzťahu pod časovým tlakom"
      ],
      "commonFlawedReasoning": [
        "Akceptuje časovú os bez spochybňovania",
        "Stáva sa konfrontačným ohľadom podozrenia z neúprimnosti",
        "Zameriava sa na morálne odsúdenie namiesto medicínskej potreby"
      ],
      "coachFollowUp": "Správne - rýchle budovanie dôvery je klinická zručnosť. Váš neodsudzujúci prístup môže doslova zachrániť životy. Ešte jeden komunikačný scenár..."
    },
    {
      "questionID": "CC008",
      "category": "Komunikácia s pacientom",
      "setup": "Ošetrujete tínedžera po predávkovaní. Teraz je stabilný, ale šepká: 'Prosím, nehovorte mojim rodičom, čo som si vzal.' Viete, že ho musíte transportovať a rodičia budú informovaní. Ako zvládnete tento moment?",
      "expectedGoodReasoning": [
        "Rozpoznáva strach a zraniteľnosť tínedžera",
        "Chápe povinné hlásenie a požiadavky na informovanie rodičov",
        "Vyvažuje úprimnosť so súcitom",
        "Jemne vysvetľuje, čo sa musí stať a prečo",
        "Zameriava sa na jeho bezpečnosť ako primárny záujem"
      ],
      "commonFlawedReasoning": [
        "Dáva falošné sľuby o dôvernosti",
        "Odmieta jeho obavy ako nedôležité",
        "Okamžite to povie rodičom bez prípravy pacienta"
      ],
      "coachFollowUp": "Dobre - ste úprimný, zatiaľ čo zostávate súcitný. Tieto situácie si vyžadujú vyváženie právnych povinností s ľudským spojením. Pokračujeme..."
    },
    {
      "questionID": "CC009",
      "category": "Nepredvídateľná situácia",
      "setup": "Podáte správny liek v správnej dávke, ale stav pacienta sa nezlepšuje - v skutočnosti sa zdá, že sa zhoršuje. Aký je váš myšlienkový proces v tom momente?",
      "expectedGoodReasoning": [
        "Prehodnocuje ABC - návrat k základom",
        "Zvažuje alternatívne diagnózy",
        "Kontroluje komplikácie zo samotnej liečby",
        "Rozpoznáva, kedy volať o pomoc/pokročilú podporu",
        "Zostáva pokojný a systematický napriek neočakávanému výsledku"
      ],
      "commonFlawedReasoning": [
        "Panikári alebo zamrzne",
        "Okamžite podá viac toho istého lieku (eskalácia bez premýšľania)",
        "Obviňuje pacienta alebo situáciu namiesto prehodnotenia"
      ],
      "coachFollowUp": "Dobrý inštinkt - keď liečba zlyhá, vráťte sa k základom. Váš systematický prístup je dôležitejší ako mať okamžité odpovede. Ešte jedna..."
    },
    {
      "questionID": "CC010",
      "category": "Nepredvídateľná situácia",
      "setup": "Prichádzate na miesto a zisťujete, že stav pacienta je úplne iný, ako hlásil dispečing. Namiesto jednoduchého pádu čelíte polytraumatickému pacientovi s potenciálnym poranením chrbtice. Ako sa prispôsobíte?",
      "expectedGoodReasoning": [
        "Okamžite volá ďalšie zdroje/RLP",
        "Vykonáva rýchle primárne vyšetrenie",
        "Upravuje mentálny model z informácií od dispečingu",
        "Uprednostňuje život ohrozujúce stavy pred menšími sťažnosťami",
        "Udržiava systematický prístup napriek prekvapeniu"
      ],
      "commonFlawedReasoning": [
        "Pokračuje s hodnotením dispečingu namiesto nálezov na mieste",
        "Je zahltený neočakávanou závažnosťou",
        "Odkladá volanie o pomoc, zatiaľ čo sa snaží zvládnuť to sám"
      ],
      "coachFollowUp": "Správne - nálezy na mieste vždy prebijú dispečing. Vaša schopnosť rýchlo sa preorientovať je kľúčová. Pokračujeme..."
    },
    {
      "questionID": "CC011",
      "category": "Nepredvídateľná situácia",
      "setup": "Počas transportu vám zlyhá vybavenie - kardiomonitor prestane fungovať a nemôžete zmerať manuálny krvný tlak. Pacient je pri vedomí, ale zdá sa byť nestabilný. Čo urobíte?",
      "expectedGoodReasoning": [
        "Vracia sa k základným hodnotiacim zručnostiam (pulz, dychová frekvencia, stav kože)",
        "Používa klinické pozorovanie (úroveň vedomia, dychová práca)",
        "Komunikuje situáciu prijímajúcej nemocnici",
        "Zvažuje zastavenie na riešenie problému, ak je to kriticky potrebné",
        "Nenechá zlyhanie vybavenia zabrániť hodnoteniu"
      ],
      "commonFlawedReasoning": [
        "Panikári kvôli nedostatku čísel",
        "Odkladá transport pri pokuse o opravu vybavenia",
        "Spolieha sa výlučne na vybavenie bez klinických zručností"
      ],
      "coachFollowUp": "Presne tak - vybavenie dopĺňa hodnotenie, nenahrádza ho. Vaše ruky a oči sú stále vaše najlepšie nástroje. Ďalšia..."
    },
    {
      "questionID": "CC012",
      "category": "Nepredvídateľná situácia",
      "setup": "Ošetrujete pacienta, keď okoloidúci náhle skolabuje nablízku. Váš súčasný pacient je stabilný, ale vyžaduje monitorovanie. Okoloidúci sa zdá byť v bezvedomí. Aký je váš rozhodovací proces?",
      "expectedGoodReasoning": [
        "Rýchlo posúdi závažnosť oboch pacientov",
        "Okamžite volá ďalšie zdroje",
        "Zvažuje, či súčasný pacient môže krátko počkať",
        "Zvažuje úrovne ohrozenia života",
        "Systematicky robí triážne rozhodnutie"
      ],
      "commonFlawedReasoning": [
        "Opustí prvého pacienta bez posúdenia",
        "Ignoruje druhého pacienta kvôli tunelovému videniu",
        "Je paralyzovaný snahou pomôcť obom súčasne"
      ],
      "coachFollowUp": "Dobre - premýšľate o princípoch triáže pod tlakom. Niekedy čelíme nemožným voľbám len s menej zlými možnosťami. Posledný nepredvídateľný scenár..."
    },
    {
      "questionID": "CC013",
      "category": "Etická dilema",
      "setup": "Ste na mieste hromadného nešťastia. Máte dvoch kritických pacientov: malé dieťa a staršieho pacienta. Obaja potrebujú okamžitý transport, ale máte len jednu sanitku. Ako premýšľate o tomto rozhodnutí?",
      "expectedGoodReasoning": [
        "Používa triážne princípy (prežiteľnosť, nie vek alebo emocionálne faktory)",
        "Zvažuje, ktorý pacient má lepšiu šancu so zásahom",
        "Rozpoznáva, že toto je klinické rozhodnutie, nie morálny úsudok",
        "Volá ďalšie zdroje počas hodnotenia",
        "Uznáva emocionálnu váhu, ale nenechá ju paralyzovať rozhodnutie"
      ],
      "commonFlawedReasoning": [
        "Vyberá len na základe veku (mladý ide automaticky prvý)",
        "Je emocionálne paralyzovaný a odkladá oboch",
        "Robí rozhodnutie na základe toho, kto si to viac 'zaslúži'"
      ],
      "coachFollowUp": "Správne - triáž je klinická, nie emocionálna alebo morálna. Tieto rozhodnutia na nás doliehajú, ale zakladáme ich na prežiteľnosti. Ďalšia dilema..."
    },
    {
      "questionID": "CC014",
      "category": "Etická dilema",
      "setup": "Pacient s terminálnym ochorením a príkazom DNR má závažnú dychovú tieseň a prosí vás, aby ste 'niečo urobili, pomohli mi dýchať.' Jeho DNR špecificky hovorí žiadna intubácia. Aké sú vaše myšlienky?",
      "expectedGoodReasoning": [
        "Chápe, že DNR neznamená 'neošetrovať'",
        "Rozpoznáva, že neinvazívna podpora (polohovanie, kyslík, lieky) je vhodná",
        "Rozlišuje medzi komfortnou starostlivosťou a zakázanými zásahmi",
        "Zvažuje súčasné želania pacienta oproti vopred vyslovenému želaniu",
        "Uznáva zložitosť starostlivosti na konci života v akútnom prostredí"
      ],
      "commonFlawedReasoning": [
        "Interpretuje DNR ako neposkytnutie žiadnej liečby",
        "Ignoruje DNR, pretože pacient momentálne žiada o pomoc",
        "Stáva sa neistým ohľadom akéhokoľvek zásahu"
      ],
      "coachFollowUp": "Dobré rozlíšenie - DNR neznamená opustenie pacienta. Môžete poskytnúť významný komfort bez porušenia jeho želaní. Pokračujeme..."
    },
    {
      "questionID": "CC015",
      "category": "Etická dilema",
      "setup": "Ošetrujete pacienta, ktorý je zjavne pod vplyvom alkoholu a je bojovný. Odmieta vyšetrenie a liečbu, ale všimnete si, čo by mohlo byť významné poranenie hlavy. Hovorí vám, aby ste odišli. Ako premýšľate o svojich povinnostiach?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že intoxikácia môže narušiť schopnosť rozhodovania",
        "Zvažuje, že poranenie hlavy by mohlo ďalej ovplyvniť mentálny stav",
        "Premýšľa o implicitnom súhlase v núdzových situáciách",
        "Vyvažuje autonómiu pacienta s obavami o bezpečnosť",
        "Zvažuje zapojenie polície pre bezpečnosť"
      ],
      "commonFlawedReasoning": [
        "Okamžite odchádza, pretože pacient odmieta",
        "Núti liečbu proti bojovnému pacientovi bez zváženia",
        "Odmieta obavy, pretože pacient je pod vplyvom alkoholu"
      ],
      "coachFollowUp": "Presne tak - určenie schopnosti rozhodovania je klinické, nielen akceptovanie alebo potlačenie odmietnutia. Tieto šedé zóny si vyžadujú úsudok. Ďalšia..."
    },
    {
      "questionID": "CC016",
      "category": "Etická dilema",
      "setup": "Prichádzate do domu, kde bol starší pacient zjavne zanedbávaný - je podvyživený, leží v znečistenej posteli a má preležaniny. Rodinný opatrovateľ trvá na tom, že 'to riešime doma.' Čo si myslíte o svojich zodpovednostiach?",
      "expectedGoodReasoning": [
        "Rozpoznáva známky potenciálneho týrania alebo zanedbávania starších osôb",
        "Chápe povinné ohlasovacie povinnosti",
        "Vyvažuje okamžité medicínske potreby s dlhodobou bezpečnosťou",
        "Zvažuje sociálne služby a služby na ochranu dospelých",
        "Premýšľa o dokumentácii pre následné kroky"
      ],
      "commonFlawedReasoning": [
        "Lieči len okamžité medicínske problémy bez riešenia zanedbávania",
        "Vyhýba sa zapojeniu do 'rodinných záležitostí'",
        "Stáva sa odsudzujúcim bez zváženia zdrojov alebo okolností"
      ],
      "coachFollowUp": "Dobre - rozpoznávate, že vaša úloha sa rozširuje za okamžitú medicínsku starostlivosť na bezpečnosť pacienta. Toto sú situácie s povinným hlásením. Posledný scenár..."
    },
    {
      "questionID": "CC017",
      "category": "Rozhodnutie pod časovým tlakom",
      "setup": "Ste uprostred hodnotenia pacienta, keď dispečing volá so zástavou srdca o dva bloky ďalej. Váš súčasný pacient má bolesť na hrudníku, ale stabilné vitálne funkcie. Vaša sanitka je najbližší zdroj. Čo vám prebieha mysľou?",
      "expectedGoodReasoning": [
        "Zvažuje relatívnu závažnosť a časovú citlivosť",
        "Zvažuje ďalšie dostupné zdroje",
        "Premýšľa o klinickom stave súčasného pacienta",
        "Rozpoznáva, že neexistuje dokonalá odpoveď",
        "Zvažuje požiadanie o ďalšie zdroje"
      ],
      "commonFlawedReasoning": [
        "Automaticky opustí súčasného pacienta pre zástavu srdca",
        "Odmieta opustiť súčasného pacienta bez ohľadu na situáciu",
        "Nezvažuje volanie ďalších zdrojov"
      ],
      "coachFollowUp": "Správne - zvažujete konkurenčné kritické potreby s neúplnými informáciami. Niekedy je najlepšou odpoveďou získať viac zdrojov. Ďalší tlakový scenár..."
    },
    {
      "questionID": "CC018",
      "category": "Rozhodnutie pod časovým tlakom",
      "setup": "Váš pacient sa zhoršuje a potrebuje okamžitý zásah, ale rodinný príslušník požaduje, aby ste vysvetlili všetko, čo robíte, a spochybňuje každý liek. Musíte pracovať rýchlo. Ako to riešite?",
      "expectedGoodReasoning": [
        "Rozpoznáva, že starostlivosť o pacienta má prioritu",
        "Zvažuje krátke uznanie obáv rodiny",
        "Premýšľa o delegovaní komunikácie na partnera",
        "Udržiava profesionálne vystupovanie pod tlakom",
        "Plánuje vysvetliť podrobnejšie, keď bude pacient stabilizovaný"
      ],
      "commonFlawedReasoning": [
        "Prestane pracovať, aby sa hádal s rodinou",
        "Úplne ignoruje rodinu a vytvára konflikt",
        "Je zmätený a stráca zameranie na pacienta"
      ],
      "coachFollowUp": "Dobre - stanovujete hranice pri zachovaní profesionality. Starostlivosť o pacienta je na prvom mieste, komunikácia, keď je to bezpečné. Pokračujeme..."
    },
    {
      "questionID": "CC019",
      "category": "Rozhodnutie pod časovým tlakom",
      "setup": "Ošetrujete kritického pacienta a uvedomíte si, že vám chýba kľúčová časť vybavenia, ktorú vyžaduje váš protokol. Nemocnica je 8 minút ďaleko. Strávite čas pokusom o improvizáciu alebo okamžite transportujete?",
      "expectedGoodReasoning": [
        "Zvažuje prínos zásahu oproti času do definitívnej starostlivosti",
        "Zvažuje, či je improvizácia bezpečná a účinná",
        "Premýšľa o 'naložiť a utekať' vs. 'zostať a hrať sa'",
        "Rozpoznáva, že nemocnica môže poskytnúť to, čo chýba",
        "Robí rozhodnutie na základe trajektórie pacienta"
      ],
      "commonFlawedReasoning": [
        "Odkladá transport pri pokuse o dokonalé dodržanie protokolu",
        "Transportuje bez zváženia akýchkoľvek zásahov na mieste",
        "Panikári kvôli chýbajúcemu vybaveniu"
      ],
      "coachFollowUp": "Presne tak - niekedy je najlepším zásahom rýchly transport. Nenechajte chýbajúce vybavenie prevalcovať dobrý úsudok. Posledná..."
    },
    {
      "questionID": "CC020",
      "category": "Rozhodnutie pod časovým tlakom",
      "setup": "Máte tri zásahy, o ktorých viete, že tento pacient potrebuje - IV prístup, kardiomonitoring a podanie liekov. Pracujete sám, pretože váš partner šoféruje. Nemôžete urobiť všetky tri súčasne. Ako sa rozhodnete, čo príde ako prvé?",
      "expectedGoodReasoning": [
        "Uprednostňuje na základe okamžitého ohrozenia života",
        "Zvažuje, ktoré zásahy umožňujú ďalšie (IV pred liekmi)",
        "Premýšľa o časovej citlivosti každého zásahu",
        "Rozpoznáva, že monitorovanie môže počkať, ak sú riešené ABC",
        "Zostáva systematický namiesto rozptýleného"
      ],
      "commonFlawedReasoning": [
        "Snaží sa robiť všetko naraz a nič nerobí dobre",
        "Vyberá najjednoduchšiu úlohu namiesto najdôležitejšej",
        "Je zahltený viacerými potrebami"
      ],
      "coachFollowUp": "Dobre - systematicky uprednostňujete pod tlakom. To je presne to myslenie, ktoré budete potrebovať. Pripravený na scenár?"
    }
  ]
}